In [1]:
import pandas as pd
import numpy as np
import sqlite3
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
print(5 and 10)

10

In [3]:
print ( 10 and 5)

5

In [4]:
2+3*2

8

In [5]:
("THIOJASIEUkeruwiouIUTI".lower())

'thiojasieukeruwiouiuti'

In [6]:
print(4%3)

1

In [7]:
print(4%4)

0

In [9]:
result = np.int64(4/2)
print(result)

2

In [11]:
arr = np.array([1,23,2,45,3,3,43])
np.average(arr)
np.absolute(arr)

array([ 1, 23,  2, 45,  3,  3, 43])

In [12]:
arr.dtype

dtype('int64')

In [13]:
print(round(2.6554435))

3

In [14]:
print(round(54.69))

55

In [19]:
df = pd.read_csv("/Users/thomassimmons/c/ds/titanic.csv")

In [16]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64